In [ ]:
from sklearn.datasets import load_iris
import pandas as pd
iris = load_iris()
iris = pd.DataFrame(data=iris.data, columns=iris.feature_names)
print(iris[:4])

In [ ]:
iris.columns = iris.columns.str.replace(" (cm)", "").str.replace(" ", "_")
print(iris)
iris["sepal_length"].head(4)
iris["sepal_length"][:5]

In [ ]:
# iris.columns
iris[["sepal_length", "sepal_width"]]

In [38]:
iris.iloc[:4]
iris.iloc[:4, :2]
iris.iloc[2:6, [1,2,3]]

   sepal_width  petal_length  petal_width
2          3.2           1.3          0.2
3          3.1           1.5          0.2
4          3.6           1.4          0.2
5          3.9           1.7          0.4

In [39]:
iris.loc[[1,2], "sepal_width":"petal_length"]

   sepal_width  petal_length
1          3.0           1.4
2          3.2           1.3

In [140]:
del score

In [141]:
score = pd.DataFrame({"국어": [90, 80], "영어": [10, 10], "수학":[70, 70]}, index = ["장화", "홍련"])
# score
score.loc["홍련", "영어"] = 100
score["국어"] = score["국어"] - 5
score

    국어   영어  수학
장화  85   10  70
홍련  75  100  70

In [51]:
print(score["국어"])
print(type(score["국어"]))
print(score["국어"]-5)
print(type(score["국어"]-5))
print(score.loc["홍련", "영어"])
print(type(score.loc["홍련", "영어"]))

장화    85
홍련    75
Name: 국어, dtype: int64
<class 'pandas.core.series.Series'>
장화    80
홍련    70
Name: 국어, dtype: int64
<class 'pandas.core.series.Series'>
100
<class 'numpy.int64'>

In [142]:
new_students = pd.DataFrame({"국어": [70, 85], "수학": [65, 100], "영어": [95, 65]}, index=["콩쥐", "팥쥐"])
score = pd.concat([score, new_students])

single_student = pd.Series({"국어": 100, "수학": 100, "영어":100}, name="햇님")

score.loc["햇님"] = single_student

score

     국어   영어   수학
장화   85   10   70
홍련   75  100   70
콩쥐   70   95   65
팥쥐   85   65  100
햇님  100  100  100

In [143]:
science = [80, 70, 90, 85, 75]
score["과학"] = science

score["학년"] = 1
score

     국어   영어   수학  과학  학년
장화   85   10   70  80   1
홍련   75  100   70  70   1
콩쥐   70   95   65  90   1
팥쥐   85   65  100  85   1
햇님  100  100  100  75   1

In [144]:
score["총점"] = score["국어"] + score["수학"] + score["영어"] + score["과학"]
score
# print(type(score["국어"] + score["수학"] + score["영어"] + score["과학"]))

     국어   영어   수학  과학  학년   총점
장화   85   10   70  80   1  245
홍련   75  100   70  70   1  315
콩쥐   70   95   65  90   1  320
팥쥐   85   65  100  85   1  335
햇님  100  100  100  75   1  375

In [155]:
# single_student
# type(score["수학"])
# print(score[:3])

    국어   영어  수학  과학  학년   총점
장화  85   10  70  80   1  245
홍련  75  100  70  70   1  315
콩쥐  70   95  65  90   1  320